Enums/ДействияВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияВиджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НичегоНеДелать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытьФормуСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходПоСсылке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьАлгоритм</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСВиджетамиКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет алгоритм команды из реквизита формы ТаблицаДействийВиджетов
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения
//  Команда	 - КомандаФормы
//
Процедура ОбработчикКоманды(Форма, Команда) Экспорт
	
	ИмяЭлемента = Команда.Имя;
	
	Отбор = Новый Структура("ИмяКоманды", ИмяЭлемента);
	СтрокиДействийСОтбором = Форма.ТаблицаДействийВиджетов.НайтиСтроки(Отбор);
	Если СтрокиДействийСОтбором.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДействия Из СтрокиДействийСОтбором Цикл
		Если СтрокаДействия.ДействиеВиджета = ПредопределенноеЗначение("Перечисление.ДействияВиджетов.НичегоНеДелать")
			Или СтрокаДействия.ДействиеВиджета = ПредопределенноеЗначение("Перечисление.ДействияВиджетов.ПустаяСсылка") Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаДействия.ДействиеВиджета = ПредопределенноеЗначение("Перечисление.ДействияВиджетов.ОткрытьФормуСписка") Тогда
		
			Если ЗначениеЗаполнено(СтрокаДействия.ПараметрПерехода) Тогда
				ИмяФормы = СтрШаблон("%1.ФормаСписка", СтрокаДействия.ПараметрПерехода);
				ОткрытьФорму(ИмяФормы);
			КонецЕсли;
			
		ИначеЕсли СтрокаДействия.ДействиеВиджета = ПредопределенноеЗначение("Перечисление.ДействияВиджетов.ПереходПоСсылке") Тогда
			
			Если ЗначениеЗаполнено(СтрокаДействия.ПараметрПерехода) Тогда
				ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрокаДействия.ПараметрПерехода);
			КонецЕсли;
			
		ИначеЕсли СтрокаДействия.ДействиеВиджета = ПредопределенноеЗначение("Перечисление.ДействияВиджетов.ВыполнитьАлгоритм") Тогда
			
			Если ЗначениеЗаполнено(СтрокаДействия.АлгоритмДействия) Тогда
				Выполнить СтрокаДействия.АлгоритмДействия;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
